app/controllers/images_controller.rb

  def create
    @image = Image.new(image_params)

    respond_to do |format|
      if @image.save
---
INSERT INTO "images" ("name", "description", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "LOL"], ["description", "WOAH"], ["image", "30W9up.gif"], ["created_at", "2017-06-02 00:25:34.664085"], ["updated_at", "2017-06-02 00:25:34.664085"]]

  def update
    respond_to do |format|
      if @image.update(image_params)
---
UPDATE "images" SET "image" = ?, "updated_at" = ? WHERE "images"."id" = ?  [["image", "30W9up.gif"], ["updated_at", "2017-06-02 01:04:44.460092"], ["id", 1]]

  def destroy
    @image.destroy
---
DELETE FROM "images" WHERE "images"."id" = ?  [["id", 1]]