app/controllers/restaurants_controller.rb

	def create
	@restaurant = Restaurant.new(params.require(:restaurants).permit(:name, :address, :phone, :food_genre))

    if @restaurant.save
---
INSERT INTO "restaurants" ("name", "address", "phone", "food_genre", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "test"], ["address", "test"], ["phone", 0], ["food_genre", "test"], ["created_at", "2017-06-12 16:16:12.368979"], ["updated_at", "2017-06-12 16:16:12.368979"]]